Repository: lang-uk/translation-metrics
Catalog: data/17099743/Animal_farm_combine.tmx
Source language: en_1945_george_orwell_animal_farm
Languages: uk_1984_iryna_dybko_khutir_tvaryn, uk_1991_yurii_shevchuk_ferma_rai_dlia_tv, uk_2020_bohdana_nosenok_kolhosp_tvaryn

source: Napoleon sent for pots of black and white paint and led the way down to the five-barred gate that gave on to the main road.
uk_1984_iryna_dybko_khutir_tvaryn: Після пояснення Давидовича, Вісарйонов наказав принести чорної й білої фарби
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Наполеон послав за горнятами з чорною і білою фарбою, а сам повів череду тварин до брами з п'ятьох перекладин, що виходила на шлях.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Наполеон послав за чорною та білою фарбою, а сам підвів усіх до брами, яка відгороджували ферму від дороги.

source: Then Snowball (for it was Snowball who was best at writing) took a brush between the two knuckles of his trotter, painted out Manor Farm from the top bar of the gate and in its place painted Animal Farm.
uk_1984_iryna_dybko_khutir_tvaryn: й нею Нікітов, бо він найкраще писав, замалював напис Панський хутір, а на тому місці написав Хутір тварин.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Потім Сніжок, бо саме він писав найкраще, затиснувши пензля ратицею, зафарбував на верхній перекладині слова «Ферма «Садиба», а натомість написав: «Рай для Тварин».
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Потім Сніжок, бо саме він найкраще писав, затиснувши в ратиці пензлик, зафарбував на арці воріт слова «Ферма „Садиба”», а натомість вивів «Колгосп тварин».

source: These Seven Commandments would now be inscribed on the wall; they would form an unalterable law by which all the animals on Animal Farm must live for ever after.
uk_1984_iryna_dybko_khutir_tvaryn: Тоді принесли драбину і на стіні написали Сім заповідей тваринізму. При цьому, виструнчившись, Вісарйонов і Давидович пояснили манерою авторитету важливість заповідей, та, що тільки ними від тепер будуть користуватися в житті. Заповіді тваринізму залишаться непорушним, невідкличним, законом назавжди!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: І от ці Сім Заповідей зараз викарбують на стіні; вони становитимуть непорушний закон, яким усі тварини мають керуватися.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тепер ці настанови викарбують на стіні й за ними звірятимуть своє життя усі тварини.

source: With some difficulty (for it is not easy for a pig to balance himself on a ladder) Snowball climbed up and set to work, with Squealer a few rungs below him holding the paint-pot.
uk_1984_iryna_dybko_khutir_tvaryn: Не з абиякими труднощами (бо не легко було Нікітову вдержати рівновагу на драбині) написав великими буквами білим кольором заповіді і тваринізму:
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Відтепер і назавжди. З певними труднощами, бо ж свині важкувато втриматися на драбині, Сніжок видерся на драбину і заходився коло роботи, а Пищик кількома щаблями нижче тримав горня з фарбою.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: З певними труднощами, адже свиням нелегко зберігати рівновагу, стоячи на сходах, Сніжок вибрався нагору й узявся до роботи. А Пискун, стоячи кількома сходинками нижче, тримав горщик із фарбою.

source: The Commandments were written on the tarred wall in great white letters that could be read thirty yards away.
uk_1984_iryna_dybko_khutir_tvaryn: [написав великими буквами білим кольором заповіді]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Заповіді вивели на обмазаній дьогтем стіні великими білими літерами, видними й за тридцять кроків.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Сім Положень вивели на шорсткій стіні великими білими літерами, щоб їх можна було прочитати, навіть стоячи за тридцять кроків від стіни.

source: Whatever goes upon two legs is an enemy.
uk_1984_iryna_dybko_khutir_tvaryn: 1. Хто б не ходив на двох ногах, це наш тяжкий ворог!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 1. Усяка двонога істота — ворог.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 1. Усі двоногі істоти — вороги.

source: Whatever goes upon four legs, or has wings, is a friend.
uk_1984_iryna_dybko_khutir_tvaryn: 2. Всі, що ходять на чотирьох або крилаті, це наші приятелі!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 2. Усяка чотиринога або крилата істота — друг.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 2. Усі чотириногі або крилаті істоти — друзі.

source: No animal shall wear clothes.
uk_1984_iryna_dybko_khutir_tvaryn: 3. Не вільно носити одягу тваринам!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 3. Жодна тварина не повинна носити одягу.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 3. Жодна тварина не повинна носити одягу.

source: No animal shall sleep in a bed.
uk_1984_iryna_dybko_khutir_tvaryn: 4. Не вільно тваринам спати в ліжку!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 4. Жодна тварина не повинна спати в ліжку.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 4. Жодна тварина не повинна спати в ліжку.

source: No animal shall drink alcohol.
uk_1984_iryna_dybko_khutir_tvaryn: 5. Не дозволяється тваринам пити алькоголю!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 5. Жодна тварина не повинна вживати спиртного.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 5. Жодна тварина не повинна вживати спиртного.

source: No animal shall kill any other animal.
uk_1984_iryna_dybko_khutir_tvaryn: 6. Тварина не має права ні в якому разі вбити тварину!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 6. Жодна тварина не повинна вбивати іншу тварину.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 6. Жодна тварина не повинна вбивати іншу тварину.

source: All animals are equal.
uk_1984_iryna_dybko_khutir_tvaryn: 7. Не має бути різниць між тваринами. Всі є рівноправними!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: 7. Усі тварини рівні.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: 7. Усі тварини рівні.

source: It was very neatly written, and except that “friend” was written “freind” and one of the “S’s” was the wrong way round, the spelling was correct all the way through.
uk_1984_iryna_dybko_khutir_tvaryn: У написаних заповідях правопис був правильний, крім букви «Я» у слові приятель. Ця буква була більшої величини й написана в протилежному напрямі.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Все було написано дуже ретельно, от тільки замість «друг» написали «друх», а в одному «у» хвостик загнули не в той бік; все ж інше цілком відповідало граматичним правилам.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Сніжок усе написав дуже акуратно, лише у слові «друзі» зробив помилку і загубив кілька закінчень у словах, але в усьому іншому орфографія була бездоганною.

source: Snowball read it aloud for the benefit of the others.
uk_1984_iryna_dybko_khutir_tvaryn: Коли вже Нікітов покінчив писати заповіді, для кращого зрозуміння їх, Давидович прочитав, кожну заповідь зокрема, вголос.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Сніжок прочитав написане вголос, і тварини згідливо закивали головами.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Для неписьменних він прочитав написане вголос.

source: All the animals nodded in complete agreement, and the cleverer ones at once began to learn the Commandments by heart.
uk_1984_iryna_dybko_khutir_tvaryn: У святковому настрої всі вислухали заповідей і одноголосно вирішили, що відсьогодні повсякчас будуть керуватись їх змістом у кожній ділянці життя, і то кожна тварина — без різниці! Ті тварини, що були обдаровані природою кращими прикметами ума, почали вивчати заповіді напам’ять.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: А кмітливіші відразу взялися завчати Заповіді напам'ять.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Усі тварини кивали головами, висловлюючи цілковиту згоду, а найрозумніші одразу взялися заучувати настанови напам’ять.

source: “Now, comrades,” cried Snowball, throwing down the paint-brush, “to the hayfield! Let us make it a point of honour to get in the harvest more quickly than Jones and his men could do.”
uk_1984_iryna_dybko_khutir_tvaryn: Коли вже налюбувались вони змістом заповідей як слід, Давидович закликав: — А тепер зберімо врожай з поля швидше, чим це робив Романов зі своїми наймитами і нехай це буде відсьогодні нашою ціллю в праці та шаною.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — А тепер, товариші, — мовив Сніжок, кидаючи пензля, — на косовицю! Нехай для кожного буде справою честі впоратися з цим скоріше, ніж це робив Джонс зі своєю челяддю.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — А тепер, товариші, — вигукнув Сніжок, відкидаючи пензлик, — нумо, на луки! Нехай для нас буде справою честі впоратися із косовицею швидше, ніж це робили Джонс і його наймити.

source: But at this moment the three cows, who had seemed uneasy for some time past, set up a loud lowing. They had not been milked for twenty-four hours, and their udders were almost bursting.
uk_1984_iryna_dybko_khutir_tvaryn: Саме тоді, коли Давидович виголошував свій заклик із патосом, три корови на все горло протяжно замукали; вони вже від довшого часу чекали на нагоду, щоб звернути увагу на те, що проходять двадцять чотири години від часу, як їх видоїли, а ось тепер мають почуття, якщо їх негайно не видоїти, їм вим’я розірвуться.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Зненацька три корови, яких з деяких пір щось непокоїло, заповзялися розпачливо мукати. їх вже добу не доїли, тож їхні вим'я мало не розривалися.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Однак після цих його слів три корови, які давно помітно хвилювалися, голосно запротестували, нагадуючи, що їх не доїли вже добу, а їхні вим’я от-от лопнуть.

source: After a little thought, the pigs sent for buckets and milked the cows fairly successfully, their trotters being well adapted to this task.
uk_1984_iryna_dybko_khutir_tvaryn: Після недовгої призадуми, свині наказали принести відра і досить вдало почали доїти корови.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Поміркувавши трохи, свині послали по відра і досить вправно видоїли корів: їхні ратиці неабияк прислужилися до цього.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Трохи поміркувавши, свині послали по відра й доволі вправно видоїли корів: з’ясувалося, що їхні ратиці добре пристосовані до такої роботи.

source: Soon there were five buckets of frothing creamy milk at which many of the animals looked with considerable interest.
uk_1984_iryna_dybko_khutir_tvaryn: Невдовзі п’ять відер виповнили вщерть молоком, яке смачно запахло сметаною, а тварини ласо поглянули на відра з молоком.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Невдовзі п'ять повних відер пінилися жирним молоком, на яке чимало тварин позирали з видимим зацікавленням.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Незабаром п’ять дійниць наповнилися парним молоком, від якого багато тварин не могли відірвати очей.

source: “What is going to happen to all that milk?” said someone.
uk_1984_iryna_dybko_khutir_tvaryn: — Що станеться з тим молоком? — хтось запитав.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — А що буде з цим молоком? — не витримав хтось.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — А що буде з молоком? — запитав хтось.

source: “Jones used sometimes to mix some of it in our mash,” said one of the hens.
uk_1984_iryna_dybko_khutir_tvaryn: — Романов доливав молоко до нашої їди, — сказала одна з курок.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Іноді Джонс трохи домішував молока нам у кашу, — докинула якась курка.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Джонс іноді підливав нам його до кормів, — завважила одна курка.

source: “Never mind the milk, comrades!” cried Napoleon, placing himself in front of the buckets.
uk_1984_iryna_dybko_khutir_tvaryn: — Не турбуйтесь молоком, товариші! — промовив Вісарйонов і став перед відрами молока.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Годі вам з тим молоком, товариші! — став коло відер Наполеон.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Та не переймайтеся цим молоком, товариші! — скрикнув Наполеон, намагаючись собою прикрити відра.

source: “That will be attended to.
uk_1984_iryna_dybko_khutir_tvaryn: Це все буде полагоджене без ваших зайвих порад і запитів.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: — Ним займуться.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: — Про нього подбають.

source: The harvest is more important.
uk_1984_iryna_dybko_khutir_tvaryn: Зараз вашим найважнішим завданням є збирання плодів із полів.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Косовиця важливіша.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Косовиця важливіша.

source: Comrade Snowball will lead the way. I shall follow in a few minutes.
uk_1984_iryna_dybko_khutir_tvaryn: Товариш Давидович проведе вас туди, а я за хвилин декілька піду вслід за вами.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Товариш Сніжок поведе вас. А я невдовзі наздожену вас.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Товариш Сніжок очолить колону, а я наздожену вас за кілька хвилин.

source: Forward, comrades! The hay is waiting.”
uk_1984_iryna_dybko_khutir_tvaryn: Спішіть товариші, спілі плоди ждуть на вас!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Уперед, товариші! Луг чекає.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Уперед, товариші! Трава чекає!

source: So the animals trooped down to the hayfield to begin the harvest, and when they came back in the evening it was noticed that the milk had disappeared.
uk_1984_iryna_dybko_khutir_tvaryn: Тож, не зволікаючи часу, тварини під проводом Давидовича подались на поля. Коли ж повернулись — молока вже не застали.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тварини посунули на косовицю, а коли ввечері повернулися, то молока вже ніде не було.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: І тварини попрямували на луки, а коли повернулися увечері, то молока вже ніде не було.

source: Chapter III
uk_1984_iryna_dybko_khutir_tvaryn: III
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Розділ ІІІ

source: How they toiled and sweated to get the hay in!
uk_1984_iryna_dybko_khutir_tvaryn: Ох, скільки зусиль і тяжкої праці вложили тварини, щоби звезти скошене сіно і плоди збіжжя до хутора.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Як же вони трудилися й сходили потом, аби заготувати сіна!
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Скільки поту пролили вони, щоб запастися сіном!

source: But their efforts were rewarded, for the harvest was an even bigger success than they had hoped.
uk_1984_iryna_dybko_khutir_tvaryn: Та не нарікали, навпаки, були задоволені й винагороджені більшою кількістю плодів цього року, як того сподівались.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Та їхні зусилля віддалися сторицею, бо врожай вдався понад усі сподівання.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Проте їхні титанічні зусилля були винагороджені: урожай виявився навіть багатшим, ніж вони сподівалися.

source: Sometimes the work was hard; the implements had been designed for human beings and not for animals, and it was a great drawback that no animal was able to use any tool that involved standing on his hind legs.
uk_1984_iryna_dybko_khutir_tvaryn: Не раз і не два праця тварин була більше чим дошкульна, бо всі приладдя помочі були для вжитку людини, тому користуватись ними було неможливо тварині. Без сумніву з належним приладдям було б тваринам легше працювати.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Часом робота давалася вкрай тяжко, адже знаряддя призначалися для людей, а не для тварин. Відчутним недоліком було й те, що жодна тварина не могла дати раду знаряддю, яке вимагало стояти на двох ногах.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Праця була нелегкою ще й через те, що всі знаряддя призначалися для людини, а жодна тварина не могла працювати, стоячи на задніх ногах.

source: As for the horses, they knew every inch of the field, and in fact understood the business of mowing and raking far better than Jones and his men had ever done.
uk_1984_iryna_dybko_khutir_tvaryn: Таким чином, до коней належало зорання поля й виконування тяжких праць. Орання піль проходило у них з більшим успіхом як за часів Романова, бо кожний клаптик землі був їм знаний; орали вони без упряжі, для себе, без нагляду людини, лише час від часу і нині, йдучи за кіньми, вигукували: «вперед, товариші!» або «го-гов, дещо взад, товариші»!
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Що ж до коней, то ті знали кожну п'ядь луки і, по суті, тямили в косінні та граблюванні куди краще, ніж Джонс та його челядь.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Щодо коней, то вони знали кожен дюйм лугу й загалом змогли виконувати роботу куди краще, ніж це будь-коли вдавалося Джонсу та його наймитам.

source: The pigs did not actually work, but directed and supervised the others. With their superior knowledge it was natural that they should assume the leadership.
uk_1984_iryna_dybko_khutir_tvaryn: [Кабани і свині не натрапляли на того роду труднощі, бо не виконували праці на полях, і завдяки кращим розумовим спроможностям, вміли писати і читати, а це вможливило їм перебрати провід над тваринами, як і призначати кожній з них зайняття.]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Свині, втім, самі не працювали, лише давали вказівки й керували іншими. Вони більше знали, тож цілком природно, що вони перебрали на себе керівництво.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Свині, щоправда, самі не працювали, зате безперервно давали вказівки й підганяли інших. Власне, було цілком природно, що вони взяли на себе керівництво, бо володіли Вищим Знанням.

source: Boxer and Clover would harness themselves to the cutter or the horse-rake (no bits or reins were needed in these days, of course) and tramp steadily round and round the field with a pig walking behind and calling out “Gee up, comrade!” or “Whoa back, comrade!” as the case might be.
uk_1984_iryna_dybko_khutir_tvaryn: [орали вони без упряжі, для себе, без нагляду людини, лише час від часу і нині, йдучи за кіньми, вигукували: «вперед, товариші!» або «го-гов, дещо взад, товариші»!]
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Боксер і Конюшинка впряглися в косарку (звісно, тепер зайвими виявилися вудила чи віжки) і без перепочинку ходили по лугу, а свиня покрикувала: «Гаття, товаришу!» або «Тпру, товаришу!» — залежно від обставин.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Боксер і Люцерна самі впряглися в косарку (ні вуздечок, ні віжок вони тепер, зрозуміло, не потребували, як і погоничів) і без упину робили коло за колом, а свиня, крокуючи за ними, закликала: «Гей, вперед, товариші!» або «Гей-гей, назад, товариші!» — залежно від ситуації.

source: And every animal down to the humblest worked at turning the hay and gathering it. Even the ducks and hens toiled to and fro all day in the sun, carrying tiny wisps of hay in their beaks.
uk_1984_iryna_dybko_khutir_tvaryn: Кожна тварина мала призначену кабанами працю, навіть найменші не мали права змарнувати часу; хто повертав скошене сіно, хто вже підсохле, складав на копиці, навіть качки й кури визбирували найменшу стебелину і несли на копицю.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: І кожна тварина, аж до найменшої, косила, перевертала й згрібала сіно. Навіть качки й кури цілий Божий день пеклися на сонці, носячи в дзьобах жмутики сіна.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Усі тварини, аж до найменших, ворушили скошене та складали сіно в копиці. Навіть кури й качки снували під пекучим сонцем, носячи в дзьобах маленькі жмутики сіна.

source: In the end they finished the harvest in two days’ less time than it had usually taken Jones and his men.
uk_1984_iryna_dybko_khutir_tvaryn: Таким чином, покінчили успішно покоси, та ще й на два дні скоріше, як це минулими роками бувало.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: І от косовиця завершилася, навіть на два дні раніше, ніж це звичайно вдавалося Джонсові з його наймитами.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Як наслідок, косовицю завершили рекордно швидко: на два дні раніше, ніж за правління Джонса.

source: The animals were happy as they had never conceived it possible to be. Every mouthful of food was an acute positive pleasure, now that it was truly their own food, produced by themselves and for themselves, not doled out to them by a grudging master.
uk_1984_iryna_dybko_khutir_tvaryn: Хоч усі пули втомлені, але вдоволені й кожний кусок поживи був непересічною насолодою, бо власним зусиллям здобутий, а не виділюваний скупими пайками скупим Романовим.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тварини неабияк тішилися, бо ж хіба вони думали, що таке можливо. Кожен з'їдений шматок невимовно смакував їм, адже тепер то був по-справжньому їхній шматок, добутий своєю працею, а не по-скнарському вділений хазяїном.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Тварини почувалися щасливими. Такого вони ніколи собі й не уявляли. Тепер їжа смакувала їм по-особливому, адже вона здобулася власною працею, а не була відміряна скупою рукою їхнього господаря.

source: With the worthless parasitical human beings gone, there was more for everyone to eat. There was more leisure too, inexperienced though the animals were.
uk_1984_iryna_dybko_khutir_tvaryn: І, хоча брак досвіду в уживанні приладдя в праці був помітний, тварини все таки знаходили час на коротке дозвілля, аж прийшов час осені.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Тепер, коли не стало ні до чого не здатних і ледачих людських істот, кожен мав що їсти. Лишалося й більше вільного часу, хоч, що не кажи, тваринам багато в чому бракувало досвіду.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Нині, коли не було цих паразитів — людей, пайка збільшилася, як і час для відпочинку.

source: They met with many difficulties — for instance, later in the year, when they harvested the corn, they had to tread it out in the ancient style and blow away the chaff with their breath, since the farm possessed no threshing machine — but the pigs with their cleverness and Boxer with his tremendous muscles always pulled them through.
uk_1984_iryna_dybko_khutir_tvaryn: В кінці літа натрапили на перші труднощі, коли, зібравши збіжжя з піль, із-за браку молотарки, мусіли подувом свого віддиху прочищувати зерно. Та по деякому часі кабани придумали, щоб запрягти Добрилова до праці, а він своїми велетенськими мускулами був у спромозі зарадити в невідрадних обставинах.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Виникало чимало труднощів. Скажімо, коли з зібраного збіжжя мусили витоптувати зерно, а провіювати — дмухаючи на нього, бо на фермі не було віялки. Але свиняча винахідливість та потужні м'язи Боксера виручили й тут.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Хоч брак досвіду самостійного господарювання давався взнаки — труднощів виникало чимало. Ближче до осені, коли достигла пшениця, їм довелося молоти її по-старому, ногами, а полову видувати власним диханням — на фермі не було молотарки. Проте винахідливість свиней і потужні м’язи Боксера, як завжди, виручили.

source: Boxer was the admiration of everybody.
uk_1984_iryna_dybko_khutir_tvaryn: Добриловим захоплювались усі на хуторі;
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Щодо Боксера, то ним захоплювались усі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Загалом Боксер у всіх тварин викликав захват.

source: He had been a hard worker even in Jones’s time, but now he seemed more like three horses than one; there were days when the entire work of the farm seemed to rest on his mighty shoulders.
uk_1984_iryna_dybko_khutir_tvaryn: він, правда, тяжко працював за часів Романова, але тепер бували дні, що в них за трьох доводилось йому працювати. Інколи так виглядало, що вся праця хутора була на плечах Добрилова.
uk_1991_yurii_shevchuk_ferma_rai_dlia_tv: Він ревно працював ще за Джонса, а тепер у нього ніби вселилося три конячі сили, а не одна. Були дні, коли, здавалося, вся робота на фермі звалювалася на його могутні плечі.
uk_2020_bohdana_nosenok_kolhosp_tvaryn: Він і при Джонсові працював багато, але тепер — за трьох. Часом здавалося, що вся робота на фермі трималася тільки на його могутніх плечах.
